Ham0osh/PSoC-Programs/test_projects/Proj05_freefly_uart_control.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_DelSig_1.h"
#include "VRx_aliases.h"
#include "VRx.h"
#include "UART_DEBUG.h"
#include "AMux_1.h"
#include "VRy_aliases.h"
#include "VRy.h"
#include "isr_adc.h"
#include "UART_MOVI.h"
#include "isr_rx_movi.h"
#include "Clock_Movi.h"
#include "ModeSwitch_aliases.h"
#include "ModeSwitch.h"
#include "Looptimer.h"
#include "isr_Looptimer.h"
#include "Pin_LED_aliases.h"
#include "Pin_LED.h"
#include "ADC_DelSig_1_AMux.h"
#include "ADC_DelSig_1_Ext_CP_Clk.h"
#include "ADC_DelSig_1_IRQ.h"
#include "ADC_DelSig_1_theACLK.h"
#include "UART_DEBUG_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

